ednieuw/ESP32Communications/Old/ESP32Arduino_CommV018/ESP32Arduino_CommV018.ino
/**************************************************************************************************/
class TSServerCallbacks : public NimBLEServerCallbacks
{
 void onConnect(NimBLEServer* pServer, ble_gap_conn_desc* desc)
 {
  TSClientConnected = true;                               
  TSconnHandle = desc->conn_handle;                       
 }

 void onDisconnect(NimBLEServer* pServer, ble_gap_conn_desc* desc)
 {
  TSClientConnected = false;                              
  TSconnHandle = 0;                                       
  NimBLEDevice::startAdvertising();                       
 }
};
/**************************************************************************************************/

void BLETimeSenderStart(void)
{
  if(TimeSenderRunning) return;                          

  NimBLEDevice::init(TIMESENDER_DEVICE_NAME);            
  TSpServer = NimBLEDevice::createServer();              
  TSpServer->setCallbacks(new TSServerCallbacks());      

  TSpService = TSpServer->createService(UART_SERVICE_UUID);                                     // Comment line ...

  TSpTX = TSpService->createCharacteristic(
              UART_CHARACTERISTIC_TX,
              NIMBLE_PROPERTY::NOTIFY
           );                                            

  TSpRX = TSpService->createCharacteristic(
              UART_CHARACTERISTIC_RX,
              NIMBLE_PROPERTY::WRITE
           );                                            

  TSpService->start();                                   

  TSpAdvertising = NimBLEDevice::getAdvertising();       
  TSpAdvertising->addServiceUUID(UART_SERVICE_UUID);     
  TSpAdvertising->start();                               

  TSlastMinute = -1;                                     
  TSdatePending = false;                                 
  TimeSenderRunning = true;                                                                      // 
}
/**************************************************************************************************/

void BLETimeSenderStop(void)
{
 if(!TimeSenderRunning) return;                                                                   // 
 if(TSpAdvertising) TSpAdvertising->stop();               
 if(TSpServer && TSClientConnected) { TSpServer->disconnect(TSconnHandle);  }
 NimBLEDevice::deinit(true);                              
 TimeSenderRunning = false;                               
 TSClientConnected = false;                               
 TSconnHandle      = 0;                                   
}
/**************************************************************************************************/

void CheckTimeSender(void)
{
 if(!TimeSenderRunning) return;                          
 if(!TSClientConnected) return;                          

 GetTijd(false);                                         

 int h  = timeinfo.tm_hour;                              
 int m  = timeinfo.tm_min;                               
 int s  = timeinfo.tm_sec;                               
 int d  = timeinfo.tm_mday;                              
 int mo = timeinfo.tm_mon + 1;                           
 int y  = timeinfo.tm_year + 1900;                       

 if(m != TSlastMinute)
   {
    char buffer[16];                                     
    sprintf(buffer,"T%02d%02d%02d",h,m,s);                
    TSpTX->setValue((uint8_t*)buffer, strlen(buffer));   
    TSpTX->notify();                                     

    TSlastMinute  = m;                                   
    TSsendDelayms = millis();                            
    TSdatePending = true;                                
   }

 if(TSdatePending && (millis() - TSsendDelayms > 1000))
   {
    char buffer[16];                                     
    sprintf(buffer,"D%02d%02d%04d",d,mo,y);               
    TSpTX->setValue((uint8_t*)buffer, strlen(buffer));   
    TSpTX->notify();                                     
    TSdatePending = false;                               
   }
}
/**************************************************************************************************/